{
  "Projects": [{
      "header": "[R&D] Closed Loop Validation of Touch, Voice & Extended Reality Systems",
      "date": "Dec 2021",
      "content": "An automated system to evaluate the performance of Personal Digital Assistants (PDA) using simulated human-like actuation. The PDA unit under test (UUT) is mounted on a 3DOF delta robot which orients it to different angles as touch, voice and gesture commands are simulated via an ATE system that consists of a 4 DOF SCARA robot, speaker, mic and a 3D depth sensor. Test cases are written alongside expected results; The robot arm is actuated to simulate touch and gestures while speaker plays an audio clip generated using Text-to-speech algorithms. PDA outputs are collected using screen recordings and voice outputs. These are analysed using RNN based deep learning models to evaluate the performance of UUTs. Building the two robots, configuration and programming using ROS, real time sensor data analysis and deep learning models were learning outcomes. Python and NLP algorithms were mastered",
      "image": "https://raw.githubusercontent.com/RSounder/onlinecv/master/src/assets/images/closedLoopPDAVnV.png?raw=true",
      "skills": ["Python", "Robotics", "ROS", "NLP: STT + TTS", "Point Cloud Analysis", "Real-time sensor signal processing"]
    },
    {
      "header": "Autonomous Customer Engagement Robot Swarm",
      "date": "Sept 2018",
      "content": "In order to enhance user experience in airports, we built a robot swarm to act as Mobile digital assistants with emphasis on airport customer experience. A robot subsystem consists of a raspberry pi SoC to send and receive data with internet via WiFi. It is connected to a ATmega328P micro-controller for sensor communication and actuation. Quadrature encoders on the motors connected to the 4x4 drive in the robot gives localization inputs along with MPU6050 triple axis gyro-accelerometer. A 180 degree proximity sensor array (build with fusion of IR and HC-SR04 sensors) gives proximity feed to arduino. A camera connected to the raspberry pi gives in visual feed to openCV algorithms running on the SoC. Localization data and proximity data from arduino's sensor arrays and array data from camera feed combine to aid the system on chip in calculating the motion trajectory when necessary, using a custom 2D Simultaneous Localization and Mapping algorithm. The trigger comes from a customer (upon being directly waved at) or from the online control panel via mobile access point. Intelligent voice chat engagement system built using LSTM coupled with TTS and STT algorithms built using python, the ACERS robot node interacts with a human and aids the human in activities like booking airplane ticket, checking status, booking hotels, information sharing and so on.",
      "image": "https://raw.githubusercontent.com/RSounder/onlinecv/master/src/assets/images/acers.png?raw=true",
      "skills": ["ROS", "SLAM", "Distributed Connected Systems", "Computer Vision"]
    },
    {
      "header": "[Thesis] Intelligent Distributed Generation in Cloud-Connected Urban Microgrids",
      "date": "Mar 2019",
      "content": "A hybrid isolated micro-grid based on renewable resources is proposed to mitigate reliability threats in conventional electric grids. The grid will also incorporate block-chain mechanism for peer-to-peer electricity transactions and overall monitoring. Incremental conductance algorithm changes the gating pulse applied to DC/DC converter in the solar photovoltaic system. In the wind power system of the proposed model, permanent magnet synchronous generator is used. The AC output of the permanent magnet synchronous generator is rectified to DC by controlled bridge rectifier. The DC output from the solar photovoltaic system and wind power system is fed to cascaded H-bridge inverter. The multilevel square output is converted to sinusoidal signal using LC filter. The output from the filter is fed to the loads. An Incremental Conductance MPPT algorithm for tracking the maximum power under partial shading conditions is modelled and simulated. In case of load variation, to maintain the voltage level, closed loop control is designed. The power received and consumed at every node is read by node monitors and are shared with the central grid for logging. The node monitors are also used to form a dynamic block-chain model to enable peer-to-peer transfer of electricity to cut down electricity costs in case of renewable subsystems being used in individual houses.",
      "image": "https://raw.githubusercontent.com/RSounder/onlinecv/master/src/assets/images/distributedGen.png?raw=true",
      "skills": ["Cyber Physical Systems", "Block Chain", "Edge Computing", "Power Electronics", "Real-time sensor signal processing"]
    },
    {
      "header": "[Thesis] UAV-AGV Symbiotic Pair for Solar Farm Maintenance",
      "date": "Mar 2018",
      "content": "A UAV-AGV symbiotic co-ordinated pair is proposed to have an autonomous, cost-efficient, round the clock PV module maintenance and solar farm security surveillance. The system provides continuous video surveillance through a camera mounted on the Quadcopter relaying data to the UGV which acts as its ground station. The UGV utilizes the video feed data to make decisions like path planning and secondary obstacle avoidance to reach its target areas (the PV modules) and clean them. If any intrusion is detected by the video feed, continuous tracking of the intruder is initiated by the hybrid pair along with alarms being raised to alert the authorities. A distributed model of computing is used in this system. Mobile robot uses a raspberry pi to perform image processing and passive SLAM tracking algorithms. The sensors and actuators are connected to an ATMEGA2560-16au micro-controller which then relays data back and forth with the main SoC controller. The mobile robot is in WiFi connection with the UAV to receive the aerial image data. Since the UGV is much rugged and can support heavy payloads, it is installed with the primary payload of water and air compressor. The idea is to use a gust of wind primarily and water secondarily to cleanse the solar PV modules on the field. Additional data processing elements such as a System on Chip and PV modules with converters are used to make the UGV a standalone control unit for the UAV. An Inductive pad is set up on the UGV to enable a wireless charge point for the UAV. The UAV is primarily used as the data source for the UGV and thus is fit with minimal components to help achieve maximum altitude and flight time.",
      "image": "https://raw.githubusercontent.com/RSounder/onlinecv/master/src/assets/images/uav-ugv.png?raw=true",
      "skills": ["Computer Vision", "Distributed systems", "Process Scheduling", "Mobile Robotics", "Passive robot localization"]
    },
    {
      "header": "[Proj] Compact Floor Cleaner Robot",
      "date": "Dec 2017",
      "content": "The robot designed autonomously navigates around an unknown environment, maps the surroundings and cleans the floor effectively. Designed the navigation, control algorithms, and implemented digital control systems of the robot. Used pre-built 2-D maps with multi sensor array (accelerometer, magnetometer, gyroscope and quadrature encoders) data processing for spatial localization. Built-in Cyclone chambers were built which lets in the air flow from a tangential input at a specified angle proportional to the length of the chamber so as to produce a whirl wind action to slide down the dust particles by the action of centrifugal force and suck up the air by the motor suction. For easy access two modes of operation has been devised: The auto mode and the manual mode. In the auto mode the functions are Mapping sequence, Real time obstacle avoidance, Auto-dock sequence, and Battery monitoring and alarm system. During the manual mode, the robot is paired with a mobile phone via bluetooth and manual motion commands can be given using a custom mobile application. Other commands such as controlling actuators, battery monitoring and time estimates to clean are also provided. In addition to that, The chassis was designed so as to keep the center of height as low as possible keeping adequate ground clearance and compact such that it could be folded and packed in a small-size export box for easy transportation.",
      "image": "https://raw.githubusercontent.com/RSounder/onlinecv/master/src/assets/images/floorcleaner.png?raw=true",
      "skills": ["Embedded Programming", "Sensor data analysis", "Data Structures & Algorithms", "Mobile Robotics", "Control system design"]
    }
  ],
  "Volunteer": [{
      "heading": "Innovation Champion, HMI CoE",
      "date": "Feb 2021 *",
      "icon": "precision_manufacturing",
      "image": "https://valiantceo.com/wp-content/uploads/2021/04/Team-Leader-1024x576.jpg",
      "org": "Robert Bosch Engineering",
      "context": "",
      "chips": ["leadership", "innovation", "patents"]
    },
    {
      "heading": "District Priority Projects Chairman",
      "date": "Aug 2020 *",
      "icon": "people",
      "image": "https://raw.githubusercontent.com/RSounder/onlinecv/master/src/assets/images/dpp.PNG",
      "org": "Rotaract, RID3201",
      "context": "Rotaract Club of Coimbatore Spectrum",
      "chips": ["leadership", "community service", "teaching"]
    },
    {
      "heading": "Treasurer, EEE Department Association",
      "date": "June 2018 - May 2019",
      "icon": "school",
      "image": "https://lh3.googleusercontent.com/proxy/olwZlbZcjIcnwOxBUBa09QNbQlbEQFuYjUsX5YtJ2pPwhxbob9SHMXUl3szZ1oAI0w_wrU5oLAmc513vh2B4fDxiAdgPhzG3d4pNDO8XqG_dAkTh_LykhjuLwfsE7oG4B_0I3qrHi02uWB_XEu1ynM5n1u-MAW86wDdgjuUvD9vLhsNxipngS1Etyr86JVIWgQ",
      "org": "EEE, CIT",
      "context": "",
      "chips": ["communication", "organization", "finance"]
    },
    {
      "heading": "Workshop manager, EEE Department Association",
      "date": "Jan 2017 - May 2018",
      "icon": "school",
      "image": "https://raw.githubusercontent.com/RSounder/onlinecv/master/src/assets/images/workshop1.PNG",
      "org": "EEE, CIT",
      "context": "",
      "chips": ["teamwork", "communication", "promotions"]
    },
    {
      "heading": "Board Member & Volunteer",
      "date": "Jan 2017 *",
      "icon": "health_and_safety",
      "image": "https://indianredcross.org/images/story-images/press-rel26-feb2019/press-rel26-feb2019.jpg",
      "org": "Youth Red Cross Society",
      "context": "",
      "chips": ["community service", "disaster relief", "teamwork"]
    },
    {
      "heading": "House Captain, Uranus (Red) House",
      "date": "June 2014 - June 2015",
      "icon": "stars",
      "image": "https://raw.githubusercontent.com/RSounder/onlinecv/master/src/assets/images/captain.PNG",
      "org": "G.D. MHSS",
      "context": "",
      "chips": ["leadership", "motivation", "communication", "teamwork"]
    }
  ],
  "Mentor": [{
      "header": "[Guest Lecture] Human-Computer Interactions",
      "date": "29 Dec 2021",
      "content": "A clear start and end date - There are projects that last several years but a project cannot go on forever. It needs to have a clear beginning, a definite end, and an overview of what happens in between. A project creates something new – Every project is unique, producing something that did not previously exist. A project is a one-time, once-off activity, never to be repeated exactly the same way again. A project has boundaries – A project operates within certain constraints of time, money, quality, and functionality. We’ll see more about this in later sections.",
      "image": "https://raw.githubusercontent.com/RSounder/onlinecv/master/src/assets/images/sathyabama_hti.jpg",
      "skills": ["Python", "Angular"]
    },
    {
      "header": "[Guest Lecture] Recent Updates in Web Technology",
      "date": "24 Dec 2021",
      "content": "A clear start and end date - There are projects that last several years but a project cannot go on forever. It needs to have a clear beginning, a definite end, and an overview of what happens in between. A project creates something new – Every project is unique, producing something that did not previously exist. A project is a one-time, once-off activity, never to be repeated exactly the same way again. A project has boundaries – A project operates within certain constraints of time, money, quality, and functionality. We’ll see more about this in later sections.",
      "image": "https://raw.githubusercontent.com/RSounder/onlinecv/master/src/assets/images/kec_webtech.jpg",
      "skills": ["Python", "Angular"]
    },
    {
      "header": "[Workshop] [Project Mentor] Hands-on IoT",
      "date": "Oct to Dec, 2021",
      "content": "",
      "image": "https://raw.githubusercontent.com/RSounder/onlinecv/master/src/assets/images/cit_iot.jpg",
      "skills": []
    },
    {
      "header": "[Guest Lecture] SVM & Random Forest Techniques",
      "date": "3 June, 2021",
      "content": "",
      "image": "https://raw.githubusercontent.com/RSounder/onlinecv/master/src/assets/images/cmr_svm_rfs.jpg",
      "skills": []
    },
    {
      "header": "[Workshop] SEED: Machine Learning for Beginners",
      "date": "31 Oct & 1 Nov, 2020",
      "content": "",
      "image": "https://raw.githubusercontent.com/RSounder/onlinecv/master/src/assets/images/seed_ml.jpg",
      "skills": []
    },
    {
      "header": "[Guest Lecture] IoT for Real Time Projects",
      "date": "Oct to Dec, 2020",
      "content": "",
      "image": "https://raw.githubusercontent.com/RSounder/onlinecv/master/src/assets/images/kec_iot.jpg",
      "skills": []
    },
    {
      "header": "[Workshop] SEED: Python Level-1",
      "date": "3 & 4, Oct 2020",
      "content": "",
      "image": "https://raw.githubusercontent.com/RSounder/onlinecv/master/src/assets/images/seed_python.jpg",
      "skills": []
    },
    {
      "header": "[Seminar] Cyber Security in Digital India",
      "date": "12 Sept, 2020",
      "content": "",
      "image": "https://raw.githubusercontent.com/RSounder/onlinecv/master/src/assets/images/cyber_security_ltlc.jpg",
      "skills": []
    }
  ],
  "Achievements": [{
      "heading": "DRR Special Recognition",
      "date": "April 2021",
      "icon": "emoji_events",
      "image": "drr_spec.jpg",
      "org": "Rotary International Dist. 3201",
      "context": "For showing leadership in community service projects and spirit of volunteering displayed during Rotary year 2020-21",
      "chips": ["leadership", "volunteering"]
    },
    {
      "heading": "",
      "date": "",
      "icon": "",
      "image": "",
      "org": "",
      "context": "",
      "chips": []
    }
  ]
}
