{
  "Projects": [{
      "header": "[R&D] Closed Loop Validation of Touch, Voice & Extended Reality Systems",
      "date": "Dec 2021",
      "content": "An automated system to evaluate the performance of Personal Digital Assistants (PDA) using simulated human-like actuation. The PDA unit under test (UUT) is mounted on a 3DOF delta robot which orients it to different angles as touch, voice and gesture commands are simulated via an ATE system that consists of a 4 DOF SCARA robot, speaker, mic and a 3D depth sensor. Test cases are written alongside expected results; The robot arm is actuated to simulate touch and gestures while speaker plays an audio clip generated using Text-to-speech algorithms. PDA outputs are collected using screen recordings and voice outputs. U+000A These are analysed using RNN based deep learning models to evaluate the performance of UUTs. &#10; Building the two robots, configuration and programming using ROS, real time sensor data analysis and deep learning models were learning outcomes. Python and NLP algorithms were mastered",
      "image": "https://raw.githubusercontent.com/RSounder/onlinecv/master/src/assets/images/closedLoopPDAVnV.png?raw=true",
      "skills": ["Python", "Robotics", "ROS", "NLP: STT + TTS", "Point Cloud Analysis", "Real-time sensor signal processing"]
    },
    {
      "header": "Autonomous Customer Engagement Robot Swarm",
      "date": "Sept 2018",
      "content": "In order to enhance user experience in airports, we built a robot swarm to act as Mobile digital assistants with emphasis on airport customer experience. A robot subsystem consists of a raspberry pi SoC to send and receive data with internet via WiFi. It is connected to a ATmega328P micro-controller for sensor communication and actuation. Quadrature encoders on the motors connected to the 4x4 drive in the robot gives localization inputs along with MPU6050 triple axis gyro-accelerometer. \\n A \n 180 degree proximity sensor array (build with fusion of IR and HC-SR04 sensors) gives proximity feed to arduino. A camera connected to the raspberry pi gives in visual feed to openCV algorithms running on the SoC.  Localization data and proximity data from arduino's sensor arrays and array data from camera feed combine to aid the system on chip in calculating the motion trajectory when necessary, using a custom 2D Simultaneous Localization and Mapping algorithm. The trigger comes from a customer (upon being directly waved at) or from the online control panel via mobile access point. Intelligent voice chat engagement system built using LSTM coupled with TTS and STT algorithms built using python, the ACERS robot node interacts with a human and aids the human in activities like booking airplane ticket, checking status, booking hotels, information sharing and so on.",
      "image": "https://raw.githubusercontent.com/RSounder/onlinecv/master/src/assets/images/acers.png?raw=true",
      "skills": ["ROS", "SLAM", "Distributed Connected Systems", "Computer Vision"]
    },
    {
      "header": "[University Project] Intelligent Distributed Generation in Cloud-Connected Urban Microgrids",
      "date": "",
      "content": "",
      "image": "",
      "skills": []
    }
  ],
  "Volunteer": [{
      "heading": "DRR Special Recognition",
      "date": "April 2021",
      "icon": "emoji_events",
      "image": "drr_spec.jpg",
      "org": "Rotary International Dist. 3201",
      "context": "For showing leadership in community service projects and spirit of volunteering displayed during Rotary year 2020-21",
      "chips": ["leadership", "volunteering"]
    },
    {
      "heading": "",
      "date": "",
      "icon": "",
      "image": "",
      "org": "",
      "context": "",
      "chips": []
    }
  ],
  "Mentor": [{
      "header": "Mentor1",
      "date": "10 Dec 2021",
      "content": "A clear start and end date – There are projects that last several years but a project cannot go on forever. It needs to have a clear beginning, a definite end, and an overview of what happens in between. A project creates something new – Every project is unique, producing something that did not previously exist. A project is a one-time, once-off activity, never to be repeated exactly the same way again. A project has boundaries – A project operates within certain constraints of time, money, quality, and functionality. We’ll see more about this in later sections.",
      "image": "https://cdn.pixabay.com/photo/2015/04/23/22/00/tree-736885__480.jpg",
      "skills": ["Python", "Angular"]
    },
    {
      "header": "",
      "date": "",
      "content": "",
      "image": "",
      "skills": []
    }
  ],
  "Achievements": [{
      "heading": "DRR Special Recognition",
      "date": "April 2021",
      "icon": "emoji_events",
      "image": "drr_spec.jpg",
      "org": "Rotary International Dist. 3201",
      "context": "For showing leadership in community service projects and spirit of volunteering displayed during Rotary year 2020-21",
      "chips": ["leadership", "volunteering"]
    },
    {
      "heading": "",
      "date": "",
      "icon": "",
      "image": "",
      "org": "",
      "context": "",
      "chips": []
    }
  ]
}
